# Scikit-Transformers : DropUniqueColumnSelector

## Imports

Import warnings and disable warnings for this notebook.

In [12]:
import warnings

warnings.filterwarnings("ignore")

Import the data libraries

In [13]:
import pandas as pd

Uncomment the following cell to install the necessary packages.

In [14]:
#!pip install scikit-transformers

Import scikit-transformers

In [15]:
try:
    from sktransf.utils import get_titanics
except Exception as e:
    print(e)
    print("Please install thea package using the following command")
    print("pip install scikit-transformers")
    from sktransf.utils import get_titanic

cannot import name 'get_titanics' from 'sktransf.utils' (/home/alex/tmp/scikit-transformers/sktransf/utils/__init__.py)
Please install thea package using the following command
pip install scikit-transformers

In [16]:
from sktransf.selector import DropUniqueColumnSelector

## Data

Get the data from the [Kaggle](https://www.kaggle.com/c/titanic/data) Titanic dataset.

In [17]:
df, _ = get_titanic()

Display the first few rows of the data.

In [18]:
df.head()

   PassengerId  Pclass   Age  SibSp  Parch     Fare
0            1       3  22.0      1      0   7.2500
1            2       1  38.0      1      0  71.2833
2            3       3  26.0      0      0   7.9250
3            4       1  35.0      1      0  53.1000
4            5       3  35.0      0      0   8.0500

Add a dummy column to the data.

In [19]:
df["dummy_column"] = "dummy"

Display the new df

In [20]:
df

     PassengerId  Pclass   Age  SibSp  Parch     Fare dummy_column
0              1       3  22.0      1      0   7.2500        dummy
1              2       1  38.0      1      0  71.2833        dummy
2              3       3  26.0      0      0   7.9250        dummy
3              4       1  35.0      1      0  53.1000        dummy
4              5       3  35.0      0      0   8.0500        dummy
..           ...     ...   ...    ...    ...      ...          ...
886          887       2  27.0      0      0  13.0000        dummy
887          888       1  19.0      0      0  30.0000        dummy
888          889       3   NaN      1      2  23.4500        dummy
889          890       1  26.0      0      0  30.0000        dummy
890          891       3  32.0      0      0   7.7500        dummy

[891 rows x 7 columns]

## Using DropUniqueColumnSelector

Fit and transform the data using the DropUniqueColumnTransformer

In [22]:
clean_df = DropUniqueColumnSelector().fit_transform(df)
clean_df

array([[  1.    ,   3.    ,  22.    ,   1.    ,   0.    ,   7.25  ],
       [  2.    ,   1.    ,  38.    ,   1.    ,   0.    ,  71.2833],
       [  3.    ,   3.    ,  26.    ,   0.    ,   0.    ,   7.925 ],
       ...,
       [889.    ,   3.    ,      nan,   1.    ,   2.    ,  23.45  ],
       [890.    ,   1.    ,  26.    ,   0.    ,   0.    ,  30.    ],
       [891.    ,   3.    ,  32.    ,   0.    ,   0.    ,   7.75  ]])

Clean_df is a np.ndarray object.
If you want to convert it back to a DataFrame, you can use the following code:

In [23]:
clean_df = DropUniqueColumnSelector(force_df_out=True).fit_transform(df)
clean_df

     PassengerId  Pclass   Age  SibSp  Parch     Fare
0              1       3  22.0      1      0   7.2500
1              2       1  38.0      1      0  71.2833
2              3       3  26.0      0      0   7.9250
3              4       1  35.0      1      0  53.1000
4              5       3  35.0      0      0   8.0500
..           ...     ...   ...    ...    ...      ...
886          887       2  27.0      0      0  13.0000
887          888       1  19.0      0      0  30.0000
888          889       3   NaN      1      2  23.4500
889          890       1  26.0      0      0  30.0000
890          891       3  32.0      0      0   7.7500

[891 rows x 6 columns]